In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import math

In [2]:
df = pd.read_csv('homeprices.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [3]:
print(math.floor(df.bedrooms.median()))

4

In [4]:
df['bedrooms'].fillna(math.floor(df.bedrooms.median()),inplace=True)

In [5]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [6]:
reg=linear_model.LinearRegression()
reg.fit(df[['area','bedrooms','age']],df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [7]:
reg.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [8]:
reg.intercept_

221323.00186540408

In [9]:
reg.predict([[3000,3,40]])

array([498408.25158031])

In [10]:
(112.06244194*3000)+(23388.88007794*3)+(-3231.71790863*40)+221323.00186540408

498408.2515740241

In [11]:
reg.predict([[2500,4,5]])

array([578876.03748933])

In [12]:
(112.06244194*2500)+(23388.88007794*4)+(-3231.71790863*5)+221323.00186540408

578876.0374840142

In [23]:
hiring_df = pd.read_csv('hiring.csv')
hiring_df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [24]:
hiring_df.columns = ['experience','test_score','interview_score','salary']
hiring_df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [26]:
hiring_df['test_score'].fillna(math.floor(hiring_df.test_score.median()),inplace=True)

In [27]:
hiring_df['experience'].fillna('zero',inplace=True)
hiring_df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [32]:
from word2number import w2n
hiring_df.experience=hiring_df.experience.apply(w2n.word_to_num)

In [33]:
hiring_df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

In [34]:
reg.fit(hiring_df[['experience','test_score','interview_score']],hiring_df.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [35]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [36]:
reg.intercept_

17737.26346433771

In [37]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [38]:
(2812.95487627*2)+(1845.70596798*9)+(2205.24017467*6)+17737.26346433771

53205.967976717715

In [39]:
reg.predict([[12,10,10]])

array([92002.18340611])

In [40]:
(2812.95487627*12)+(1845.70596798*10)+(2205.24017467*10)+17737.26346433771

92002.1834060777